tap "homebrew/bundle"
tap "jesseduffield/lazydocker"
tap "mike-engel/jwt-cli"
tap "ngrok/ngrok"
tap "smart-mcp-proxy/mcpproxy"
tap "steipete/tap"
tap "teamookla/speedtest"

brew "aichat"
brew "asciiquarium"
brew "atuin"
brew "openssl@3"
brew "azure-cli"
brew "bat"
brew "btop"
brew "cmake"
brew "cmatrix"
brew "cowsay"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fileicon"
brew "fortune"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-gui"
brew "graphviz"
brew "htop"
brew "hyperfine"
brew "jless"
brew "jq"
brew "just"
brew "lazygit"
brew "libpq"
brew "minikube"
brew "navi"
brew "ncdu"
brew "tree-sitter"
brew "neovim"
brew "nvm"
brew "pgvector"
brew "pipx"
brew "postgresql@18"
brew "pre-commit"
brew "ripgrep"
brew "sl"
brew "telnet"
brew "thefuck"
brew "tilt"
brew "tlrc"
brew "tmux"
brew "toilet"
brew "tree"
brew "tree-sitter-cli"
brew "vivid"
brew "watch"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "jesseduffield/lazydocker/lazydocker"
brew "mike-engel/jwt-cli/jwt-cli"
brew "smart-mcp-proxy/mcpproxy/mcpproxy"
brew "teamookla/speedtest/speedtest"

cask "codex"
cask "db-browser-for-sqlite"
cask "iterm2"
cask "postman"
cask "warp"

vscode "charliermarsh.ruff"
vscode "eamodio.gitlens"
vscode "github.copilot-chat"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "tomoki1207.pdf"

go "golang.org/x/tools/gopls"
go "github.com/sahilsasane/mcp-go"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "text-embeddings-router"
npm "@anthropic-ai/mcpb"
npm "@earendil-works/pi-coding-agent"
npm "corepack"
