tap "homebrew/bundle"

# Core shell and terminal tooling
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "git-gui"
brew "htop"
brew "hyperfine"
brew "jq"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "watch"
brew "yq"

# Editors and dev UX
brew "just"
brew "lazygit"
brew "neovim"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Language and platform CLIs used by this setup
brew "gh"
brew "kubernetes-cli"
brew "libpq"
brew "mcpproxy"
brew "minikube"
brew "nvm"
brew "pipx"
brew "tilt"
brew "uv"

# Terminal app
cask "iterm2"
